# Project 2

In [1]:
# Import necessary libraries
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

%matplotlib inline

### CLIENT PROFILES DF

In [2]:
# Read Client Profiles dataset
archivo_clients = "/Users/natalialabrador/Desktop/Ironhack/Proyectos/5. EDA + Tableau/df_final_demo.txt"
client_profiles_df = pd.read_csv(archivo_clients)

In [3]:
# Show first rows of the dataframe
client_profiles_df.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0

In [5]:
# See the dimensions of the dataframe
client_profiles_df.shape

(70609, 9)

In [6]:
# See data types for every column
client_profiles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   client_id         70609 non-null  int64
 1   clnt_tenure_yr    70595 non-null  float64
 2   clnt_tenure_mnth  70595 non-null  float64
 3   clnt_age          70594 non-null  float64
 4   gendr             70595 non-null  object
 5   num_accts         70595 non-null  float64
 6   bal               70595 non-null  float64
 7   calls_6_mnth      70595 non-null  float64
 8   logons_6_mnth     70595 non-null  float64
dtypes: float64(7), int64(1), object(1)
memory usage: 4.8+ MB

In [7]:
# Check for null values 
client_profiles_df.isna().sum()

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [8]:
# Check for duplicated values
client_profiles_df.duplicated().any()

False

In [9]:
# Change column name for column gendr
client_profiles_df.rename(columns={'gendr': 'gender'}, inplace=True)

In [10]:
# Reestructure categories for gender column
new_gender_categories = {'M': 'male', 'F': 'female', 'U': 'unknown', 'X': 'unknown'}
client_profiles_df['gender'] = client_profiles_df['gender'].replace(new_gender_categories)
client_profiles_df['gender'].value_counts()

gender
unknown    24125
male       23724
female     22746
Name: count, dtype: int64

In [11]:
# Replace null values 
client_profiles_df['clnt_tenure_yr'].fillna(client_profiles_df['clnt_tenure_yr'].mean(), inplace=True)
client_profiles_df['clnt_tenure_mnth'].fillna(client_profiles_df['clnt_tenure_yr'].mean(), inplace=True)
client_profiles_df['clnt_age'].fillna(client_profiles_df['clnt_age'].median(), inplace=True)
client_profiles_df['gender'].fillna(client_profiles_df['gender'].mode()[0], inplace=True)
client_profiles_df['num_accts'].fillna(client_profiles_df['num_accts'].mean(), inplace=True)
client_profiles_df['bal'].fillna(client_profiles_df['bal'].mean(), inplace=True)
client_profiles_df['calls_6_mnth'].fillna(client_profiles_df['calls_6_mnth'].mean(), inplace=True)
client_profiles_df['logons_6_mnth'].fillna(client_profiles_df['logons_6_mnth'].mean(), inplace=True)

In [12]:
# Check for null values again
client_profiles_df.isna().sum()

client_id           0
clnt_tenure_yr      0
clnt_tenure_mnth    0
clnt_age            0
gender              0
num_accts           0
bal                 0
calls_6_mnth        0
logons_6_mnth       0
dtype: int64

In [13]:
# Show first rows of the dataframe to see the changes
client_profiles_df.head()

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gender,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,unknown,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,unknown,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,unknown,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,male,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,female,2.0,103671.75,0.0,3.0

In [14]:
# Save the new dataframe as a CSV file
client_profiles_df.to_csv('client_profiles_df.csv', index=False)

### DIGITAL FOOTPRINTS DF

In [15]:
# Read Digital Footprints 1 dataset
archivo_digital_1 = "/Users/natalialabrador/Desktop/Ironhack/Proyectos/5. EDA + Tableau/df_final_web_data_pt_1.txt"
digital_footprints_1_df = pd.read_csv(archivo_digital_1)

In [16]:
# Show first rows of the dataframe
digital_footprints_1_df.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [17]:
# Oldest daytime in digital_footprints_1_df
digital_footprints_1_df["date_time"].min()

'2017-03-15 00:03:03'

In [18]:
# Latest daytime in digital_footprints_1_df
digital_footprints_1_df["date_time"].max()

'2017-04-30 23:59:16'

In [19]:
# See the dimensions of the dataframe
digital_footprints_1_df.shape

(343141, 5)

In [20]:
# See data types for every column
digital_footprints_1_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 343141 entries, 0 to 343140
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     343141 non-null  int64
 1   visitor_id    343141 non-null  object
 2   visit_id      343141 non-null  object
 3   process_step  343141 non-null  object
 4   date_time     343141 non-null  object
dtypes: int64(1), object(4)
memory usage: 13.1+ MB

In [21]:
# Read Digital Footprints 2 dataset
archivo_digital_2 = "/Users/natalialabrador/Desktop/Ironhack/Proyectos/5. EDA + Tableau/df_final_web_data_pt_2.txt"
digital_footprints_2_df = pd.read_csv(archivo_digital_2)

In [22]:
# Show first rows of the dataframe
digital_footprints_2_df.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,763412,601952081_10457207388,397475557_40440946728_419634,confirm,2017-06-06 08:56:00
1,6019349,442094451_91531546617,154620534_35331068705_522317,confirm,2017-06-01 11:59:27
2,6019349,442094451_91531546617,154620534_35331068705_522317,step_3,2017-06-01 11:58:48
3,6019349,442094451_91531546617,154620534_35331068705_522317,step_2,2017-06-01 11:58:08
4,6019349,442094451_91531546617,154620534_35331068705_522317,step_1,2017-06-01 11:57:58

In [23]:
# See the dimensions of the dataframe
digital_footprints_2_df.shape

(412264, 5)

In [24]:
# See data types for every column
digital_footprints_2_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 412264 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     412264 non-null  int64
 1   visitor_id    412264 non-null  object
 2   visit_id      412264 non-null  object
 3   process_step  412264 non-null  object
 4   date_time     412264 non-null  object
dtypes: int64(1), object(4)
memory usage: 15.7+ MB

In [25]:
# Latest daytime in digital_footprints_2_df
digital_footprints_2_df["date_time"].max()

'2017-06-20 23:59:57'

In [26]:
# Oldest daytime in digital_footprints_2_df
digital_footprints_2_df["date_time"].min()

'2017-05-01 00:00:26'

In [48]:
# Concat digital_footprints1_df and digital_footprints_2_df
digital_footprints_df = pd.concat([digital_footprints_1_df, digital_footprints_2_df])

In [66]:
# Show first rows of the merged dataframe
digital_footprints_df.head()

,client_id,visitor_id,visit_id,process_step,date_time
0,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:27:07
1,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:26:51
2,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:19:22
3,9988021,580560515_7732621733,781255054_21935453173_531117,step_2,2017-04-17 15:19:13
4,9988021,580560515_7732621733,781255054_21935453173_531117,step_3,2017-04-17 15:18:04

In [50]:
# See the dimensions of the dataframe
digital_footprints_df.shape

(755405, 5)

In [51]:
# See data types for every column
digital_footprints_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 755405 entries, 0 to 412263
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   client_id     755405 non-null  int64
 1   visitor_id    755405 non-null  object
 2   visit_id      755405 non-null  object
 3   process_step  755405 non-null  object
 4   date_time     755405 non-null  object
dtypes: int64(1), object(4)
memory usage: 34.6+ MB

In [52]:
# Check for null values 
digital_footprints_df.isna().sum()

client_id       0
visitor_id      0
visit_id        0
process_step    0
date_time       0
dtype: int64

In [56]:
# Check for duplicated values
digital_footprints_df.duplicated().sum()

10764

In [57]:
# Save the merged dataframe as a CSV file
digital_footprints_df.to_csv('digital_footprints_df.csv', index=False)

### EXPERIMENT ROSTER DF

In [34]:
# Read Experiment Roster dataset
archivo_experiment = "/Users/natalialabrador/Desktop/Ironhack/Proyectos/5. EDA + Tableau/df_final_experiment_clients.txt"
experiment_roster_df = pd.read_csv(archivo_experiment)

In [35]:
# Show first rows of the dataframe
experiment_roster_df.head()

   client_id Variation
0    9988021      Test
1    8320017      Test
2    4033851   Control
3    1982004      Test
4    9294070   Control

In [36]:
# See the dimensions of the dataframe
experiment_roster_df.shape

(70609, 2)

In [37]:
# See data types for every column
experiment_roster_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70609 entries, 0 to 70608
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  70609 non-null  int64
 1   Variation  50500 non-null  object
dtypes: int64(1), object(1)
memory usage: 1.1+ MB

In [38]:
# Check for null values 
experiment_roster_df.isna().sum()

client_id        0
Variation    20109
dtype: int64

In [39]:
# Check for duplicated values
experiment_roster_df.duplicated().sum()

0

In [40]:
# Save the dataframe as a CSV file
experiment_roster_df.to_csv('experiment_roster_df.csv', index=False)

#### Check digital footprint and attributes of clients with null variation

In [41]:
# Check if every client belong to one group or more
count_variation = experiment_roster_df.groupby('client_id')['Variation'].count()
count_variation

client_id
169        0
555        1
647        1
722        0
934        1
          ..
9999400    1
9999626    1
9999729    1
9999832    1
9999839    0
Name: Variation, Length: 70609, dtype: int64

In [42]:
# Count number of variations
count_variation.value_counts()

Variation
1    50500
0    20109
Name: count, dtype: int64

#### Check if clients with null variation are in the digital footprint df

#### Dataframe for clients with null variation

In [58]:
# Create a dataframe for clients that don't belong to any group
client_id_null_variation = experiment_roster_df.loc[experiment_roster_df['Variation'].isnull(), 'client_id'].unique()
df_client_id_null_variation = pd.DataFrame({'client_id': client_id_null_variation})
df_client_id_null_variation

       client_id
0        5459747
1        8031000
2        1847030
3        9713157
4        7775828
...          ...
20104    2443347
20105    8788427
20106     266828
20107    1266421
20108    9895983

[20109 rows x 1 columns]

In [59]:
# Join clients without group and digital footprint df to check if they were part of the test
df_client_null_digital = pd.merge(df_client_id_null_variation, digital_footprints_df_prueba, on='client_id', how='inner')
df_client_null_digital

,client_id,visitor_id,visit_id,process_step,date_time
0,5459747,927506343_21566395546,126601512_42206463738_739012,confirm,2017-05-22 12:14:45
1,5459747,927506343_21566395546,126601512_42206463738_739012,step_3,2017-05-22 12:14:27
2,5459747,927506343_21566395546,126601512_42206463738_739012,step_2,2017-05-22 12:14:13
3,5459747,927506343_21566395546,126601512_42206463738_739012,step_1,2017-05-22 12:13:50
4,5459747,927506343_21566395546,126601512_42206463738_739012,start,2017-05-22 12:13:43
...,...,...,...,...,...
128517,9895983,473024645_56027518531,498981662_93503779869_272484,step_3,2017-06-15 19:52:09
128518,9895983,473024645_56027518531,498981662_93503779869_272484,step_2,2017-06-15 19:50:37
128519,9895983,473024645_56027518531,498981662_93503779869_272484,step_1,2017-06-15 19:50:05
128520,9895983,473024645_56027518531,498981662_93503779869_272484,start,2017-06-15 19:50:00
128521,9895983,473024645_56027518531,498981662_93503779869_272484,start,2017-06-15 19:44:05

#####  Clients with null variation are registered in the digital footprint df

#### Check attributes of clients with null variation

In [60]:
# Join clients without group and clients_profile to see their attributes
df_client_null_profile = pd.merge(df_client_id_null_variation, client_profiles_df, on='client_id', how='inner')
df_client_null_profile

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gender,num_accts,bal,calls_6_mnth,logons_6_mnth
0,5459747,16.0,193.0,40.0,male,2.0,125294.61,7.0,7.0
1,8031000,13.0,159.0,27.0,female,3.0,46626.04,3.0,3.0
2,1847030,9.0,108.0,73.0,female,2.0,59586.81,1.0,1.0
3,9713157,13.0,156.0,40.0,male,2.0,62641.70,2.0,2.0
4,7775828,15.0,191.0,30.5,female,2.0,22226.56,2.0,2.0
...,...,...,...,...,...,...,...,...,...
20104,2443347,17.0,204.0,52.5,male,3.0,164693.48,7.0,7.0
20105,8788427,10.0,121.0,59.5,male,2.0,203149.13,3.0,3.0
20106,266828,14.0,172.0,60.5,male,2.0,1135068.68,7.0,7.0
20107,1266421,13.0,164.0,33.0,male,3.0,27701.79,2.0,3.0
20108,9895983,10.0,121.0,49.0,male,2.0,97748.22,2.0,2.0